AUTO_config_TK_pesok/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <comment>Заказы поставщикам</comment>
  <resources>
    <name>Заказано</name>
    <comment>Количество номенклатуры по заказу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура заказа</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ПараметрыСистемыЗаказов/ПараметрыСистемыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыСистемыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЗаказа</name>
    <type>
      <types>EnumRef.ВидыПериодичностиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ДниНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПоставки</name>
    <comment>Срок поставки (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПоставкиПоДнямНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругленияКоличества</types>
    </type>
  </resources>
  <resources>
    <name>КвантПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МодельРасчета</name>
    <type>
      <types>EnumRef.ВидыКоличестваЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокВитрина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегламентЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура для которой сохраняются цены</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПокупателей</name>
  <comment>Заказы покупателей</comment>
  <resources>
    <name>Заказано</name>
    <comment>Количество номенклатуры по заказу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <comment>Сумма заказанной номенклатуры в валюте управленческого учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления заказа</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура заказа</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>Контрагент, разместивший заказ</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании на котором был зарезервирован товар для этого заказа</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/РезервыТоваров/РезервыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТоваров</name>
  <resources>
    <name>Резерв</name>
    <comment>Количество зарезервированного товара на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления Резерва</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/ОбработкаЗаказовПоставщику/ОбработкаЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбработкаЗаказовПоставщику</name>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/CommonModules/ЗаказыСервер/Module.bsl
#Область ПроцедурыЗаписиДвиженийВРегистр

Процедура ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПоставщикам;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗаказыПоставщикам.Записывать = Истина;
	Движения.ЗаказыПоставщикам.Загрузить(Таблица);

КонецПроцедуры

Процедура ОтразитьПараметрыСисетмыЗаказов(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыСистемыЗаказов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ПараметрыСистемыЗаказов.Записывать = Истина;
	Движения.ПараметрыСистемыЗаказов.Загрузить(Таблица);

КонецПроцедуры


Процедура ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗаказыПокупателей.Записывать = Истина;
	Движения.ЗаказыПокупателей.Загрузить(Таблица);

КонецПроцедуры

Процедура ОтразитьЗаказыПоставщика(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПоставщикам;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗаказыПоставщикам.Записывать = Истина;
	Движения.ЗаказыПоставщикам.Загрузить(Таблица);

КонецПроцедуры


Процедура ОтразитьРезервыТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРезервыТоваров;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.РезервыТоваров.Записывать = Истина;
	Движения.РезервыТоваров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОбработкаЗаказовПоставщику(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОбработкаЗаказовПоставщику;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ОбработкаЗаказовПоставщику.Записывать = Истина;
	Движения.ОбработкаЗаказовПоставщику.Загрузить(Таблица);

КонецПроцедуры

#КонецОбласти


Процедура ПодготовитьТаблицуЗакрытияЗаказовПокупателя(Запрос, ДополнительныеСвойства)Экспорт
	
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
//	ТипЗакрытия    = ДополнительныеСвойства.ДляПроведения.ЗакрытиеЗаказов;

	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Заказ");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	
	ТаблицаДвижения.Колонки.Добавить("Заказано");
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ЗаказыПокупателей.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;

	
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.Контрагент КАК Контрагент,
	|	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&МоментВремени,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					ВтТаблицаЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
	|				ИЗ
	|					ВтТаблицаЗаказы КАК ВтТаблицаЗаказы)) КАК ЗаказыПокупателейОстатки";
	
	
	
	
	
	Запрос.Текст = ТекстЗапроса;
	ТаблицаОстатков = 	Запрос.Выполнить().Выгрузить();
	
	
	ТекстЗапроса = " ВЫБРАТЬ
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВтТаблицаТовары.Количество) КАК Количество
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.Номенклатура";
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	СтрокаТоваров = РезультатЗапроса.Выбрать();

	Пока СтрокаТоваров.Следующий() Цикл 
		//СписаноСЗаказа = 0; ВсегоЗаказано = 0;
		НадоСписать = СтрокаТоваров.Количество;

		СтруктураОтбора = Новый Структура("Номенклатура", СтрокаТоваров.Номенклатура);
		
		МассивНайденныхСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			СтрокаОстатка = МассивНайденныхСтрок[Сч];
			Если СтрокаОстатка.Заказано<=0 тогда Продолжить;КонецЕсли; 
		//	ВсегоЗаказано 	= ВсегоЗаказано + СтрокаОстатка.Заказано;
			
			Если НадоСписать<>0 Тогда
				НоваяЗапись = ТаблицаДвижения.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаОстатка);
				НоваяЗапись.Период = Период;
				НоваяЗапись.ВидДвижения =  ВидДвиженияНакопления.Расход;
				НоваяЗапись.ХозОперация =  ХозОперация;
				
				НоваяЗапись.Заказано		= Мин(НадоСписать, СтрокаОстатка.Заказано);
				//СписаноСЗаказа	 = СписаноСЗаказа + НоваяЗапись.Заказано;
				СтрокаОстатка.Заказано = СтрокаОстатка.Заказано - НоваяЗапись.Заказано;
				
				НадоСписать = НадоСписать - НоваяЗапись.Заказано;
			КонецЕсли;
			
			//Если СтрокаТоваров.Количество>ВсегоЗаказано Тогда 	
			//	
			//	
			//	
			//	
			//КонецЦикла;
			
			
			
		КонецЦикла;
		КонецЦикла;	
	
	
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
		Если СтрокаОстатка.Заказано = 0 Тогда Продолжить;КонецЕсли;
		
		НоваяЗаписьЗакрытие = ТаблицаДвижения.Добавить();	
		НоваяЗаписьЗакрытие.ВидДвижения		= ВидДвиженияНакопления.Расход;
		НоваяЗаписьЗакрытие.Период			= Период;
		НоваяЗаписьЗакрытие.Контрагент		= СтрокаОстатка.Контрагент;
		НоваяЗаписьЗакрытие.СкладКомпании	= СтрокаОстатка.СкладКомпании;
		НоваяЗаписьЗакрытие.Заказ			= СтрокаОстатка.Заказ;
		НоваяЗаписьЗакрытие.Номенклатура	= СтрокаОстатка.Номенклатура;
		НоваяЗаписьЗакрытие.ХозОперация		= Справочники.ХозОперации.УменьшениеОтгрузки;
		НоваяЗаписьЗакрытие.Заказано		= СтрокаОстатка.Заказано;
	КонецЦикла;

	
	
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл 
	//	СтрокаДвижения = ТаблицаДвижения.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаДвижения,Выборка);
	//КонецЦикла;
	////
	//ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	//ТаблицаДвижения.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,"ВидДвижения");	

	//ТаблицаДвижения.ЗаполнитьЗначения(ХозОперация,"ХозОперация");	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПокупателей",ТаблицаДвижения);	

КонецПроцедуры

Процедура ПодготовитьТаблицуЗакрытияРезервовПокупателя(Запрос, ДополнительныеСвойства)Экспорт
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	                 |	ВтТаблицаЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
	                 |ИЗ
	                 |	ВтТаблицаЗаказы КАК ВтТаблицаЗаказы";
					 
	Запрос.Текст = ТекстЗапроса;
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	 
	//
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;

	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("Заказ");
	ТаблицаДвижения.Колонки.Добавить("Резерв");
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.РезервыТоваров.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;

	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РезервыТоваровОстатки.Склад КАК Склад,
	               |	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
	               |	РезервыТоваровОстатки.Характеристика КАК Характеристика,
	               |	РезервыТоваровОстатки.Заказ КАК Заказ,
	               |	РезервыТоваровОстатки.РезервОстаток КАК Резерв
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			&МоментВремени,
	               |			Заказ В
	               |				(ВЫБРАТЬ
	               |					ВтТаблицаЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
	               |				ИЗ
	               |					ВтТаблицаЗаказы КАК ВтТаблицаЗаказы)) КАК РезервыТоваровОстатки";
	
	
	
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НоваяСтрокаДвижений =  ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДвижений,Выборка);
		НоваяСтрокаДвижений.Период = Период;
		НоваяСтрокаДвижений.ВидДвижения  = ВидДвиженияНакопления.Расход;
		НоваяСтрокаДвижений.ХозОперация  = ХозОперация;
	КонецЦикла;
	

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезервыТоваров",ТаблицаДвижения);	

КонецПроцедуры

Процедура ПодготовитьТаблицуЗакрытияЗаказовПокупателяКорректировка(Запрос, ДополнительныеСвойства)Экспорт
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;

	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Заказ");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	
	ТаблицаДвижения.Колонки.Добавить("Заказано");
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ЗаказыПокупателей.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;

	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.Контрагент КАК Контрагент,
	|	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток * -1 КАК Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&МоментВремени,
	|			Заказ = &ЗаказПокупателя) КАК ЗаказыПокупателейОстатки";
	
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаОстатков = Запрос.Выполнить().Выбрать();
		
	Пока ВыборкаОстатков.Следующий() Цикл 
		Если ВыборкаОстатков.Заказано = 0 Тогда Продолжить;КонецЕсли;
		
		НоваяЗаписьЗакрытие = ТаблицаДвижения.Добавить();	
		НоваяЗаписьЗакрытие.ВидДвижения		= ВидДвиженияНакопления.Приход;
		НоваяЗаписьЗакрытие.Период			= Период;
		НоваяЗаписьЗакрытие.Контрагент		= ВыборкаОстатков.Контрагент;
		НоваяЗаписьЗакрытие.СкладКомпании	= ВыборкаОстатков.СкладКомпании;
		НоваяЗаписьЗакрытие.Заказ			= ВыборкаОстатков.Заказ;
		НоваяЗаписьЗакрытие.Номенклатура	= ВыборкаОстатков.Номенклатура;
		НоваяЗаписьЗакрытие.ХозОперация		= ХозОперация;
		НоваяЗаписьЗакрытие.Заказано		= ВыборкаОстатков.Заказано;
	КонецЦикла;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПокупателей", ТаблицаДвижения);	

КонецПроцедуры

Процедура ПодготовитьТаблицуЗакрытияРезервовПокупателяКорректировка(Запрос, ДополнительныеСвойства)Экспорт
		 
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;

	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("Заказ");
	ТаблицаДвижения.Колонки.Добавить("Резерв");
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.РезервыТоваров.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РезервыТоваровОстатки.Склад КАК Склад,
	               |	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
	               |	РезервыТоваровОстатки.Характеристика КАК Характеристика,
	               |	РезервыТоваровОстатки.Заказ КАК Заказ,
	               |	РезервыТоваровОстатки.РезервОстаток * -1 КАК Резерв
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			&МоментВремени,
	               |			Заказ = &ЗаказПокупателя) КАК РезервыТоваровОстатки";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НоваяСтрокаДвижений =  ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДвижений,Выборка);
		НоваяСтрокаДвижений.Период = Период;
		НоваяСтрокаДвижений.ВидДвижения  = ВидДвиженияНакопления.Приход;
		НоваяСтрокаДвижений.ХозОперация  = ХозОперация;
	КонецЦикла;
	

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезервыТоваров",ТаблицаДвижения);	

КонецПроцедуры




Процедура ПодготовитьТаблицуЗакрытияЗаказовПоставщику(Запрос, ДополнительныеСвойства)Экспорт
	
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВтТаблицаЗаказы.ЗаказПоставщику КАК ЗаказПоставщику
	|ИЗ
	|	ВтТаблицаЗаказы КАК ВтТаблицаЗаказы";
	
	Запрос.Текст = ТекстЗапроса;
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ТипЗакрытия    = ДополнительныеСвойства.ДляПроведения.ЗакрытиеЗаказов;
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("ЗаказПоставщику");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ТорговаяПлощадка",Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТаблицаДвижения.Колонки.Добавить("Заказано");
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗаказыОстатки.Контрагент КАК Контрагент,
	               |	ЗаказыОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	               |	ЗаказыОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ЗаказыОстатки.ЗаказаноОстаток КАК Заказано
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |			&МоментВремени,
	               |			ТорговаяПлощадка = &ТорговаяПлощадка
	               |				И Контрагент = &Контрагент
	               |				И ЗаказПоставщику В
	               |					(ВЫБРАТЬ
	               |						ВтТаблицаЗаказы.ЗаказПоставщику КАК ЗаказПоставщику
	               |					ИЗ
	               |						ВтТаблицаЗаказы КАК ВтТаблицаЗаказы)) КАК ЗаказыОстатки";
	
	
	
	
	
	Запрос.Текст = ТекстЗапроса;
	ТаблицаОстатков = 	Запрос.Выполнить().Выгрузить();
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	               |	ВтТаблицаТовары.ТорговаяПлощадка КАК ТорговаяПлощадка
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.Номенклатура,
	               |	ВтТаблицаТовары.ТорговаяПлощадка";
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	СтрокаТоваров = РезультатЗапроса.Выбрать();
	
	Пока СтрокаТоваров.Следующий() Цикл 
		
		НадоСписать = СтрокаТоваров.Количество;
		
		СтруктураОтбора = Новый Структура("Номенклатура,ТорговаяПлощадка", СтрокаТоваров.Номенклатура,СтрокаТоваров.ТорговаяПлощадка);
		
		МассивНайденныхСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			СтрокаОстатка = МассивНайденныхСтрок[Сч];
			Если СтрокаОстатка.Заказано<=0 тогда Продолжить;КонецЕсли; 
			
			Если НадоСписать<>0 Тогда
				НоваяЗапись = ТаблицаДвижения.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаОстатка);
				НоваяЗапись.Период = Период;
				НоваяЗапись.ВидДвижения =  ВидДвиженияНакопления.Расход;
				НоваяЗапись.ХозОперация =  ХозОперация;
				
				НоваяЗапись.Заказано		= Мин(НадоСписать, СтрокаОстатка.Заказано);
				//СписаноСЗаказа	 = СписаноСЗаказа + НоваяЗапись.Заказано;
				СтрокаОстатка.Заказано = СтрокаОстатка.Заказано - НоваяЗапись.Заказано;
				
				НадоСписать = НадоСписать - НоваяЗапись.Заказано;
			КонецЕсли;
			
			//Если СтрокаТоваров.Количество>ВсегоЗаказано Тогда 	
			//	
			//	
			//	
			//	
			//КонецЦикла;
			
			
			
		КонецЦикла;
	КонецЦикла;	
	
	
	Если ТипЗакрытия = 1 Тогда 	
		
		Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
			Если СтрокаОстатка.Заказано = 0 Тогда Продолжить;КонецЕсли;
			
			НоваяЗаписьЗакрытие = ТаблицаДвижения.Добавить();	
			НоваяЗаписьЗакрытие.ВидДвижения		= ВидДвиженияНакопления.Расход;
			НоваяЗаписьЗакрытие.Период			= Период;
			НоваяЗаписьЗакрытие.Контрагент		= СтрокаОстатка.Контрагент;
			НоваяЗаписьЗакрытие.ЗаказПоставщику	= СтрокаОстатка.ЗаказПоставщику;
			НоваяЗаписьЗакрытие.Номенклатура	= СтрокаОстатка.Номенклатура;
			НоваяЗаписьЗакрытие.ТорговаяПлощадка= СтрокаОстатка.ТорговаяПлощадка;
			НоваяЗаписьЗакрытие.ХозОперация		= Справочники.ХозОперации.Недопоставка;
			НоваяЗаписьЗакрытие.Заказано		= СтрокаОстатка.Заказано;
		КонецЦикла;
		
	КонецЕсли;
	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПоставщикам",ТаблицаДвижения);	
	
КонецПроцедуры
